name: "iplayer"
force_backward: true

input: "data"
input_dim: 32
input_dim: 1
input_dim: 28
input_dim: 28

layer {
  name: "pre_conv"
  type: "Convolution"
  bottom: "data"
  top: "pre_conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "pre_conv"
	top: "pre_conv"
	name: "pre_conv_bn"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "pre_conv"
	top: "pre_bn"
	name: "pre_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "pre_relu"
  type: "ReLU"
  bottom: "pre_bn"
  top: "pre_bn"
}
################################ conv1.x ################################
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "pre_bn"
  top: "conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
	bottom: "conv1_1"
	top: "bn_1_1_"
	name: "bn_1_1_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "bn_1_1_"
	top: "bn1_1"
	name: "bn1_1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "bn1_1"
  top: "bn1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "bn1_1"
  top: "conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv1_2"
	top: "bn_1_2_"
	name: "bn_1_2_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}
layer {
	bottom: "bn_1_2_"
	top: "bn1_2"
	name: "bn1_2"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "bn1_2"
  top: "bn1_2"
}
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "bn1_2"
  top: "conv1_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv1_3"
	top: "bn_1_3_"
	name: "bn_1_3_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "bn_1_3_"
	top: "bn1_3"
	name: "bn1_3"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu1_3"
  type: "ReLU"
  bottom: "bn1_3"
  top: "bn1_3"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "bn1_3"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
################################ conv2.x ################################
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv2_1"
	top: "bn_2_1_"
	name: "bn_2_1_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "bn_2_1_"
	top: "bn2_1"
	name: "bn2_1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "bn2_1"
  top: "bn2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "bn2_1"
  top: "conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv2_2"
	top: "bn_2_2_"
	name: "bn_2_2_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "bn_2_2_"
	top: "bn2_2"
	name: "bn2_2"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "bn2_2"
  top: "bn2_2"
}
layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "bn2_2"
  top: "conv2_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv2_3"
	top: "bn_2_3_"
	name: "bn_2_3_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "bn_2_3_"
	top: "bn2_3"
	name: "bn2_3"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu2_3"
  type: "ReLU"
  bottom: "bn2_3"
  top: "bn2_3"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "bn2_3"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
################################ conv3.x ################################
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv3_1"
	top: "bn_3_1_"
	name: "bn_3_1_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}


layer {
	bottom: "bn_3_1_"
	top: "bn3_1"
	name: "bn3_1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "bn3_1"
  top: "bn3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "bn3_1"
  top: "conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv3_2"
	top: "bn_3_2_"
	name: "bn_3_2_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}
layer {
	bottom: "bn_3_2_"
	top: "bn3_2"
	name: "bn3_2"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "bn3_2"
  top: "bn3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "bn3_2"
  top: "conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "conv3_3"
	top: "bn_3_3_"
	name: "bn_3_3_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}
layer {
	bottom: "bn_3_3_"
	top: "bn3_3"
	name: "bn3_3"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "bn3_3"
  top: "bn3_3"
}
################################ global pool ################################
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "bn3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool3"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
	bottom: "ip1"
	top: "bn_ip_"
	name: "bn_ip_"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
		eps : 0.00001
	}
}
layer {
	bottom: "bn_ip_"
	top: "bn_ip"
	name: "bn_ip"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "relu_ip"
  type: "ReLU"
  bottom: "bn_ip"
  top: "bn_ip"
}
